// Завдання 2: Конкатенація радків та шаблонний рядок

// Створіть дві змінні, які містять імена двох осіб. Використовуючи конкатенацію рядків, 
// створіть новий рядок, який містить вітання для обох осіб. Виведіть результат в консоль. 
// Потім використайте шаблонний рядок для створення того ж вітання. Виведіть результат в консоль.

const tom = "Tom";
const john = "John";


function sayHello(name1, name2){
  console.log("Hello, " + name1 + " and " + name2 + "!"); // тут буде конкатинація
  console.log(`Hello, ${name1} and ${name2}!`); // але цей варіант кращий
}

sayHello(tom, john)